{
    "content": [
        {
            "id": "en",
            "grammar": {
                "o": "the",
                "a": "the",
                "do": "by the",
                "da": "by the",
                "por": "by",
                "para": "for"
            },
            "words": {
                "project": "project",
                "about": "about",
                "stage": "stage"                
            },
            "credit": {
                "selfVenn": "Project by Venn.",
                "selfSolo": "Solo Project.",
                "clientVenn1": "Developed by Venn",
                "clientVenn2": "Developed by Venn. Project by",
                "clientSolo": "Developed solo for "
            },
            "dashboard": {
                "about": "about pedro's work",
                "business": "pedro's business ventures",
                "portolio": "pedro's work portfolio",
                "projects": "pedro's own projects"
            },
            "footnote": {
                "background": "background art:",
                "name": "La esfinge",
                "author": "by David Gore"
            },
            "about": {
                "intro":[
                    "This a dev space. That means you’ll find technology, innovative ideas and off course awesome implementations. That’s the build part.",
                    "You’ll also find out about disruption, decentralization and radical perspectives. That’s the destroy part. We build disruptive tech to destroy power structures.",
                    "If you are at all interested in that, here is  a brief introduction."
                ],
                "paragraphs": [
                    "I am a self taught web(3) full stack developer and smart contract engineer with particular expertise in EVM environments. Although i am proficient in web development, decentralized networks are what interest me the most. Why? They enable the progressive erosion of all artificial power structures that permeate our society today.",
                    "Among these type of networks, one kind stands out nowadays. The one base on a tech called Blockchain. The ecosystem of web applications that use blockchains a data layers is often called web3 or ‘crypto’.",
                    "I have about 3 years experience in developing open source web3 applications, including all facets of the work, from smart contract engineering to web integration, having won prizes in hackathons and grants from big web3 players.",
                    "During those 3 years, having dived deep into the space and learned a bit about the nature of this technology, i had a glimpse of the repercussions that the widespread use of this class of applications can have. And not even myself or the top dogs in this field can grasp what awaits us on the other side of this transition.",
                    "The clear part is that decentralized networks, not only blockchain, but all the truly decentralized ones, can bring about a fundamentally voluntary society. One where coercion is merely punitive, and no peaceful person will, by norm, be forced to associate with any corrupt organization. People will be sovereign and institutions will exist to serve the people, not the other way around.",
                    "Today the power structure is realizing it’s own fragility in face of such a powerful entity. Or should i say entities.  That is why we see movements of censorship, false indictments, despotic imprisonments. But the most beautiful thing is, these entities are all independent of one another, they have no central coordination, no authority over anyone. But yet, together they can be more powerful than all the governments combined. They can truly be what democracy promised to be but never delivered. Technology is our way out.",
                    "Aside from that, i love developing. From vanilla web to web 3, DeFi to NFTs, smart contracts, AI integrations, decentalized compute, decentralized storage, decentralized runtime, anything cool that hasn’t been done. If it ruins some legacy institution or big monoploy along the way, even better. I have fun even doing some web design nowadays. YOLO.",
                    "I have an academic background in engineering (B.Sc) and Applied Economics (M.A). As a developer, i am a founding member of Venn Studio, where i act as full-stack  dev, smart-contract engineer, protocol designer and sometimes web designer.",
                    "If you wanna learn more about these kind of stuff you can download the ol’ boring CV in the button below. I can freelance, even job, if it’s really worth my time. And i am not talking about the money. If you read all the way to here, reach out, let’s chat."
                ]
            },
            "business": {
                "label": "Role:",
                "venn": {
                    "description": [
                        "is as software studio focused on developing innovative solutions on web, mobile, decentralized apps, smart contract protocols, AI and Blockchain integrations.",
                        "Founded in 2024 after a year or so of collaboration between it's 3 founders, Pedro Franceschin, Bernardo Franceschin and Fernanda Duarte."
                    ],
                    "role": "Co-owner, engineer, full-stack developer."
                }
            },
            "portfolio": {
                "dapps": [
                    {
                        "name": "venn protocol",
                        "description": [
                            "NFT rental protocol. Includes an on-chain Marketplace and a Smart Contract Wallet."
                        ]
                    }
                ],
                "apps": [
                    {
                        "name": "deforestation calculator",
                        "description": [
                            "Tool that estimates the economical impact of deforestation in the Amazon."
                        ],
                        "client": "Conservation Stratgegy Fund"
                    }
                ],
                "pages": [
                    {
                        "name": "calculator hub",
                        "client": "Conservation Stratgegy Fund"
                    },
                    {
                        "name": "oga imobiliaria",
                        "client": "OGA Imobiliária"
                    }
                ],
                "credit": {
                    "selfVenn": "Projeto by Venn.",
                    "selfSolo": "Solo Project.",
                    "clientVenn1": "Developed by Venn",
                    "clientVenn2": "Developed by Venn. Project by",
                    "clientSolo": "Developed solo"
                }
            },
            "projects": {
                "descriptions": [
                    "using Venn Smart Accounts and Venn Marketplace, users can rent NFT's without collateral in a completely safe and trustless manner. Venn Protocol leverages Account Abstraction and ERC-4337, in a innovative approach to NFT rental scolutions.",
                    "protocol that leverages blockchain to enable automatic and recursive funding distribution based on a cross-reference tree. The main cases being studied right now are ‘open source software’ (possibly including package manager and github integration), publishing (scientific and otherwise) and music streaming. The core concept is that instances of work that receive funding can share it, in a programmatic fashion, with other works that had relevant contribution."
                ],
                "stages": {
                    "early": "early development"                    
                }
            }
        },
        {
            "id": "pt",
            "grammar": {
                "o": "o",
                "a": "a",
                "do": "do",
                "da": "da",
                "para": "para"
            },
            "words": {
                "project": "projeto",
                "about": "sobre",
                "stage": "estágio"                
            },
            "credit": {
                "selfVenn": "Projeto do Venn.",
                "selfSolo": "Projeto solo.",
                "clientVenn1": "Desenvolvido por Venn",
                "clientVenn2": "Desenvolvido por Venn. Project do ",
                "clientSolo": "Desenvolvido solo para "
            },
            "dashboard": {
                "about": "about pedro's work",
                "business": "pedro's business ventures",
                "portolio": "pedro's work portfolio",
                "projects": "pedro's own projects"
            },
            "footnote": {
                "background": "arte de fundo:",
                "name": "La esfinge",
                "author": "de David Gore"
            },
            "about": {
                "intro":[
                    "Esse é um espaço de dev. Isso significa que você vai encontrar tecnologia, idéias inovadoras e, é claro, implementações incríveis. Essa é a parte da construção.",
                    "Você também vai ver sobre decentralização, disrupção e perspectivas radicais. Essa é a parte da destruição. Nós construímos tecnologia disruptiva pra destruir estruturas de poder.",
                    "Se isso te interessa, segue uma breve introdução."
                ],
                "paragraphs": [
                    "Eu sou um dev web(3) full-stack e engenheiro de contratos inteligentes autodidata com expertise especial em ambientes EVM. Sou proficiente em desenvolvimento web, mas o que me interessa realmente são redes decentralizadas. Porque? Elas permitem a erosão progressiva de todas as estruturas de poder artificiais que permeam a nossa sociedade hoje.",
                    "Entre esses tipos de rede, uma classe se destaca atualmente. São as redes baseadas na tecnologia chamada Blockchain. O ecossistema de aplicações web que usam blockchains como camadas de dados é comumente chamado de web3 ou crypto.",
                    "Eu tenho cerca de 3 anos de experiência desenvolvendo aplicações web3 de código aberto, incluindo engenharia de contratos e integração web, e ganhei prêmios em hackathons e bolsas de grandes players do setor.",
                    "Durante esses 3 anos, depois de mergulhar fundo nesse espaço e aprender um bocado sobre a natureza desse tipo de tecnologia, eu pude vislumbrar as repercussões que a utilização em massa dessa classe de aplicações pode ter. Mas nem mesmo eu ou os grandes peixes desse mercado sabem o que nos espera do outro lado dessa transição.",
                    "O que é claro é que redes decentralizadas, não só blockchains mas todas que são realmente decentralizadas, podem nos dar uma sociedade fundamentalmente voluntária, onde coerção é meramente punitiva, e nenhuma pessoa pacífica irá, por norma, ser forçada a se associar com nenhuma organização corrupta. Pessoas serão soberanas e as instituições existirão pra servir o povo, não ao contrário.",
                    "As estruturas de poder já estão percebendo a própria fragilidade frente a essa entidade tão poderosa. Ou devo dizer entidades. Por esse motivo vemos movimentos de censura, falsas acusações e emprisionamentos despóticos. Mas o mais lindo é que essas entidades são completamente independentes uma da outra, completamente desprovidas de coordenação central, não têm autoridade sobre ninguém. Contudo combinadas, elas são mais poderosas que todos os governos somados e multiplicados. Elas podem realmente ser o que a democracia nos prometeu mas nunca entregou. Tecnologia é a saída.",
                    "Além disso eu amo desenvolver. De vanilla web a web 3, DeFi a NFTs, contratos inteligentes, integração AI, compute decentralizado, armazenamento decentralizado, runtime decentralizado, qualquer coisa maneira que ainda não foi feita. Se uma instituição velha for arruinada no processo, melhor ainda. Atualmente eu me divirto até fazendo um pouco de desing web. YOLO.",
                    "Eu tenho background em Engenharia (B.Sc.) e Economia Aplicada (M.A.). Como dev, sou membro fundador do Venn Studio, onde atuo como dev full stack, engenheiro de contratos, designer de protocolos e às vezes até web desing.",
                    "Se quiser saber mais sobre esse tipo de coisa, você pode baixar o tedioso CV no botão abaixo. Eu faço freela, talvez até job, se valer meu tempo. E não to falando do dinheiro. Se você leu até aqui, me manda uma mensagem, vamos trocar uma idéia."
                ]
            },
            "business": {
                "label": "Cargo:",
                "venn": {
                    "description": [
                        "é um estúdio de software especializado em desenvolver soluções inovadoras em web, mobile, apps decentralizados (dapps), protocolos de contratos inteligentes, integração de AI e Blockchain.",
                        "Fundado em 2024 depois de cerca de 2 anos de colaboração entre seus três fundadores, Pedro Franceschin, Bernardo Franceschin e Fernanda Duarte."
                    ],
                    "role": "sócio, engenheiro, desenvolvedor full-stack."
                }
            },
            "portfolio": {
                "dapps": [
                    {
                        "name": "venn protocol",
                        "description": [
                            "Protocolo de aluguel de NFT. Inclui um Marketplace on-chain e uma Smart Contract Wallet.",
                            "Projeto do Venn."
                        ]
                    }
                ],
                "apps": [
                    {
                        "name": "Calculadora do desmatamento",
                        "description": [
                            "Ferramenta que estima o impacto econômico de desmatamentos na Amazônia."
                        ],
                        "client": "Conservation Stratgegy Fund"
                    }
                ],
                "pages": [
                    {
                        "name": "hub das calculadoras",
                        "client": "Conservation Stratgegy Fund"
                    },
                    {
                        "name": "oga imobiliaria",
                        "client": "OGA Imobiliária"
                    }
                ],
                "credit": {
                    "selfVenn": "Projeto do Venn.",
                    "selfSolo": "Projeto solo.",
                    "clientVenn1": "Desenvolvido por Venn",
                    "clientVenn2": "Desenvolvido por Venn. Project do ",
                    "clientSolo": "Desenvolvido solo"
                }
            },
            "projects": {
                "descriptions": [
                    "usando Venn Smart Accounts e o Venn Marketplace, usuários podem alugar NFT's, sem necessidade de usar ativos como colateral, de uma forma completamente segura e sem nenhuma hipótese de confiança. Venn Protocol usa o conceito de Account Abstraction e o padrão ERC-4337 para oferecer um abordagem completamente inovadora para aluguéis de NFT.",
                    "protocolo que move a tecnologia blockchain para permitir uma distribuição de funding automática e recursiva baseada numa árvore de referência cruzada. Os principais casos de uso sendo estudados no momento são 'softwares de código aberto (possivelmente incluindo integrações com package managers e github), publicação de artigos (científicos e não-científicos) e streaming de música. O conceito chave é que trabalhos que recebem funding podem compartilhá-lo, de forma programática, com outros trabalhos que ofereceram contribuições relevantes"
                ],
                "stages": {
                    "early": "early development"                    
                }
            }
        }
    ]
}